evaluators/consistency/evaluator.yaml
schema_version: "1"
evaluator:
  id: consistency
  version: "1"
  revision: source-tree
  target_profile: artemis-java-maven
  implementation_digest: a8389e81a880b54bad8536cc66159d265487d543b99b858195fe1016f6a53bdd
suite:
  id: consistency-development
  version: "1"
  digest: edffda5cff7a45f3e14bb6825cf1a6da8b807c17b15bc19e56d2a328bc408063
requested_metrics:
  - consistency.residual_count
  - consistency.ungrounded_statement_identifiers
  - consistency.unmentioned_public_api
  - consistency.contradicted_constructs
  - consistency.unsupported_statement_values
  - consistency.satisfied
process:
  argv: [ "{bun}", "run", "worker.ts" ]
  cwd: "."
  env: {}
execution:
  timeout_ms: 120000
  concurrency: 4
  maximum_input_bytes: 1048576
  maximum_response_bytes: 16777216
  maximum_log_bytes: 1048576
  termination_grace_ms: 5000